/**
 * 错误码
 */
export const SDK_ERROR_MAP: Record<string, string> = {
  // 90xx 通用错误
  'XYSDK:969001': '成功',
  'XYSDK:969002': '网络错误',
  'XYSDK:969003': '内部状态错误',
  'XYSDK:969004': '人脸识别未开通',
  // 00xx错误码 2023-6/16号从openapi网站copy进来，原因是之前网站记录的错误码在sdk中丢失
  'XYSDK:960006': '域名配置错误，请检查',
  'XYSDK:960028': '接口请求超时，请稍后重试',
  // 10xx rest错误
  'XYSDK:961000': '请求数据为空，请检查',
  'XYSDK:961001': '登录displayName乱码', // v1.0.2版本以下可能出现，请用encodeURI或encodeURIComponent进行编码
  'XYSDK:961006': '无效密码',
  'XYSDK:961011': '密码错误',
  'XYSDK:961012': '无效的账号或密码',
  'XYSDK:961014': '无效的账号',
  'XYSDK:961028': '连续五次输入密码错误, 请稍后重试',
  'XYSDK:961029': '密码错误',
  'XYSDK:961030': '登录频率受限，请稍后重试',
  'XYSDK:961043': '无效企业ID',
  'XYSDK:961045': '无效APPKEY',
  'XYSDK:961046': '操作权限被拒绝',
  'XYSDK:961047': '服务错误',
  'XYSDK:961048': '无法访问服务器',
  // 20xx 初始化错误
  'XYSDK:962001': '无效的账号或密码',
  'XYSDK:962002': '没有登录',
  'XYSDK:962004': '账号不存在',
  'XYSDK:962030': '手机号码错误',
  // 30xx 呼叫错误
  'XYSDK:963001': '云会议室密码不正确，请重试',
  'XYSDK:963002': '无效会议号',
  'XYSDK:963003': '会议异常断开',
  // 39xx 录制服务器错误码
  'XYSDK:963901': '录制参数错误',
  'XYSDK:963902': '没有录制权限',
  'XYSDK:963903': '云会议室不属于任何企业，无法录制',
  'XYSDK:963904': '当前云会议室存储空间已满，不能再发起录制', // 录制的存储空间已满，您无法开始录制
  'XYSDK:963905': '当前云会议室存储空间已满，不能再发起录制', // 云会议室存储空间已满，不能再发起录制
  'XYSDK:963906': '当前云会议室存储空间已满，不能再发起录制', // 所属部门的云会议室存储空间已满，不能再发起录制
  'XYSDK:963907': '当前云会议室存储空间已满，不能再发起录制', // 所属企业的云会议室存储空间已满，不能再发起录制
  // 40xx 被踢原因
  'XYSDK:964000': '多个长连接建立、需要退出重新登录',
  'XYSDK:964001': '另一部设备登录、需要退出重新登录',
  'XYSDK:964003': '无效SK鉴权失败、需要退出重新登录',
  'XYSDK:964010': '账号已停用, 如需恢复请联系管理员', // 密码已重置, 请重新登录
  // user locked
  'XYSDK:964017': '账号已停用, 如需恢复请联系管理员',
  // 41xx 鉴权失败
  'XYSDK:964101': '数据请求超时，请稍后重试',
  'XYSDK:964102': '当前接口暂未开放',
  'XYSDK:964103':
    '该接口的访问需要进行token认证，但是header中没有携带token；或者调用的接口未在api网关进行配置',
  'XYSDK:964104': 'Token已过期',
  'XYSDK:964105': '没有操作权限',
  'XYSDK:964106': '网关刷新Token已过期，请重新登录',
  'XYSDK:964107': '请求Body数据内容超过1MB，请检查',
  'XYSDK:964108': 'API网关不存在该签名版本，请检查',
  // 50xx 三方登录错误
  'XYSDK:965001': '使用未加密的接口进行操作', // 密码相关的不加密
  'XYSDK:965002': '无效的公钥',
  'XYSDK:965003': '加密协议错误',
  'XYSDK:965004': '网络异常',
  'XYSDK:965005': 'externUserId不合法',
  'XYSDK:965006': 'authcode不合法',
  'XYSDK:965007': 'authcode已过期',
  'XYSDK:965008': 'authcode已被使用',
  'XYSDK:965009': '参数不合法',
  'XYSDK:965010': '未知登录类型',
  // 特殊错误
  'XYSDK:960700': '内部错误', // 例如qa52环境没有对接三方
  // callState error

};

export const KICK_OUT_MAP: Record<string, string> = {
  'XYSDK:964000': '多个重复长连接建立',
  'XYSDK:964001': '您的账号在另一地点登录，您被迫下线',
  'XYSDK:964003': '登录过期',
  'XYSDK:964010': '账号已停用，如需恢复请联系管理员',
};
